example-cases/channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;

vertices
(
    (0 0 0)             //0
    (0.1 0 0)           //1
    (0.1 0.1 0)         //2
    (0 0.1 0)           //3
    
    (0 0 1)             //4
    (0.1 0 1)           //5
    (0.1 0.1 1)         //6
    (0 0.1 1)           //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (1 1 100)
    simpleGrading 
    (
        1 
        1
		10
    )
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (2 6 5 1)
        );
    }
    channelCenter
    {
        type symmetryPlane;
        faces
        (
            (5 6 7 4)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
