example-cases/channel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       99;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       199;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    channelCenter
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       299;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       300;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       301;
    }
)

// ************************************************************************* //
