example-cases/channel/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          nu;
}

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0.000315;

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    channelCenter
    {
        type            symmetryPlane;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0.000315;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
